/***********************************************************************
 * Моля, преименувате файла, като:
 *   - замените G с групата, с която ходите на упражнения
 *   - замените F с вашия факултетен номер
 **********************************************************************/

/***********************************************************************
Задача 5. Дума наричаме последователност от малки и големи латински букви. 
Изречение наричаме низ, който представлява последователност от думи, 
разделени с точно един интервал. Да се реализира функция с минимална 
сложност по време bool permuteOrSingle(std::string const& s1, std::string 
const& s2, std::ostream& os), която проверява дали изречението s2 може да 
се получи с подходящо разместване на думите в изречението s1. Ако 
отговорът е „не", функцията да извежда на потока os думите, които се 
срещат само в едно изречение, разделени с интервал. Каква е сложността на
решението?
************************************************************************/

#include <iostream>

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

bool permuteOrSingle(std::string const& s1, std::string const& s2, std::ostream& os);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
//#include "5_tests.hpp"

int main () {
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}
